<template>
    <div>
     <!--   <button @click="isshow = !isshow">显示/隐藏</button>
        <div v-if="isshow">
            {{msg}}
        </div>
        <div v-show="isshow">
            {{msg}}
        </div>-->

    <!--    <button @click="isshow = !isshow">切换</button>
        <div v-if="isshow">
            1111111111111111111<br>
            1111111111111111111<br>
            1111111111111111111<br>
            1111111111111111111<br>
            1111111111111111111<br>
        </div>
        <div v-else>
            2222222222222222222222<br>
            2222222222222222222222<br>
            2222222222222222222222<br>
            2222222222222222222222<br>
            2222222222222222222222<br>
        </div>-->

        <button @click="card=1">按钮一</button>
        <button @click="card=2">按钮二</button>
        <button @click="card=3">按钮三</button>
        <button @click="card=19">按钮四</button>
        <div v-if="card == 1">
            1111111111111111111<br>
            1111111111111111111<br>
            1111111111111111111<br>
            1111111111111111111<br>
            1111111111111111111<br>
        </div>
        <div v-else-if="card == 2">
        2222222222222222222222<br>
        2222222222222222222222<br>
        2222222222222222222222<br>
        2222222222222222222222<br>
        2222222222222222222222<br>
    </div>
        <div v-else-if="card == 3">
          333333333333333333333333333<br>
          333333333333333333333333333<br>
          333333333333333333333333333<br>
          333333333333333333333333333<br>
          333333333333333333333333333<br>
          333333333333333333333333333<br>
        </div>

        <div v-else>
            #########################<br>
            #########################<br>
            #########################<br>
            #########################<br>
            #########################<br>
            #########################<br>
            #########################<br>
            #########################<br>
            #########################<br>
        </div>
    </div>
</template>

<script>
    export default {
        name: "App",
        data() {
            return {
                msg:"this is test",
                isshow:true,
                card:1
            }
        },
        methods:{

        }
    }
</script>

<style scoped>

</style>